{
  "broadArea": {
    "name": "Computer Science and Engineering",
    "link": "http://www.vlab.co.in/broad-area-design-engineering",
    "code": "DESIGN"
  },
  "lab": "Drone Technology",
  "lab_display_name": "Drone Technology",
  "phase": "3-ext",
  "collegeName": "IITD",
  "baseUrl": "drone-iitd.vlabs.ac.in",
  "introduction": "The Virtual Drone Engineering Lab is an interactive, web-based platform designed to provide learners with hands-on experience in drone technology, flight dynamics, and control systems through virtual simulations and guided experiments. Developed as part of the initiative to enhance technical education using digital tools, this lab allows students, enthusiasts, and professionals to explore drone engineering concepts without the need for physical hardware. Drones, also known as unmanned aerial vehicles (UAVs), have revolutionized sectors such as agriculture, surveillance, logistics, disaster management, and aerial photography. Understanding their design, functionality, and control mechanisms is essential for aspiring engineers and innovators. However, access to real drones for experimentation is often limited due to high costs and safety concerns. The Virtual Drone Engineering Lab bridges this gap by offering a simulated environment where learners can:<br><ul><li>Study the principles of flight and aerodynamics.</li> <li>Design and simulate drone models (quadcopters, fixed-wing, etc.).</li> <li>Understand and implement control algorithms such as PID controllers.</li> <li>Perform virtual experiments related to sensor integration, GPS navigation, obstacle avoidance, and autonomous flight.</li> <li>Analyze flight performance and optimize design parameters.</li> By combining theoretical knowledge with immersive simulations, this lab empowers learners to develop problem-solving</li></ul><br> skills, innovate in UAV design, and prepare for real-world applications in drone technology. It is especially beneficial for institutions looking to integrate drone education into their curriculum with minimal infrastructure.",
 "experiments":[
  {
    "name": "Assembling of Electrical Components of Drone",
    "short-name": "assembling-electrical-components",
    "repo": "https://github.com/virtual-labs/exp-assembling-of-electrical-components-of-drone-iitd",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Assembling of Software Based Components of Drone",
    "short-name": "assembling-software-based-components",
    "repo": "https://github.com/virtual-labs/exp-assembling-of-software-based-components-of-drone-iitd",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Drone’s Software Download, Installation and Calibration",
    "short-name": "software-download-installation-calibration",
    "repo": "https://github.com/virtual-labs/exp-drones-software-download-installation-and-calibration-iitd",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Drone’s Take-off, Flight and Landing Basics",
    "short-name": "drones-take-off-flight-landing-basics",
    "repo": "https://github.com/virtual-labs/exp-drones-take-off-flight-and-landing-basics-iitd",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Operation of Agricultural Drone",
    "short-name": "operation-agricultural-drone",
    "repo": "https://github.com/virtual-labs/exp-operation-of-agricultural-drone-iitd",
    "tag": "v1.0.0",
    "deploy": true
  }
],
  "targetAudience": {
    "UG": [
     "Under Graduate students of B.E./B.Tech."
    ],
    "PG": [
      "Research Scholars, faculty of various institutes and universities"]
  },
  "objective": "<ul><li> To recall the fundamentals of Drone engineering and workings</li><li>To understand the theory behind an experimental procedure</li><li>To apply the concepts learned to perform experiments</li><li>To analyze and present the output from the experiments</li></ul>",
  "courseAlignment": {
    "description": "The syllabi of this lab aligns to the following universities in India.",
    "universities": [
      "Anna University; 15ECP18; Introduction to Quadcopters",
      "Savitribai Phule Pune University; AI4009; Internet Of Things",
       "Bennett University, Greater Noida; ECSE378L; Drone Applications, Components and Assembly",
       "Amrita Vidhwa Vidyapeetham; 21AIE103; Introduction to Drones"
    ]

 
}
}
